########################################################################################################################
# TODO арифметические операторы

print(10 + 10)  # сложение
print(10 - 10)  # вычитание

print(10 * 10)  # умножение
print(10 / 10)  # деление
print(15 // 10)  # целочисленное деление (отбрасывает дробную часть)

print(15 % 4)  # остаток от деления
print(9 % 2 == 0)  # проверка числа на чётность
print(9 % 2 != 0)  # проверка числа на нечётность

print(2**4)  # возведение в степень
print(16**0.5)  # извлечение из под корня

import math

print(math.sqrt(16))  # извлечение из под корня с помощью библиотеки
print(math.exp(2))  # ... другие математические операции

print(15 < 4)  # меньше
print(15 > 4)  # больше
print(15 == 4)  # равно
print(15 != 4)  # не равно
print(15 <= 4)  # меньше или равно
print(15 >= 4)  # больше или равно

########################################################################################################################
