########################################################################################################################
# TODO условный оператор if-else

bool_condition1 = False

if bool_condition1:
    print("Правда 1")
# else:
#     pass

if bool_condition1:
    print("Правда 2")
else:
    print("Ложь 2")

# таблица истинности
!
if True and False:
    print("Правда 2")
else:
    print("Ложь 2")

value = 40

if value > 100:
    print("Правда 3 1")
else:
    if value > 50:
        print("Правда 3 2")
    else:
        if value > 30:
            print("Правда 3 3")
        else:
            if value > 20:
                print("Правда 3 4")
            else:
                print("Ложь 3 1")

if value > 100:
    print("Правда 3 1")
elif value > 50:
    print("Правда 3 2")
elif value > 30:
    print("Правда 3 3")
elif value > 20:
    print("Правда 3 4")
else:
    print("Ложь 3 1")


fruit = "абрикос"

if fruit == "абрикос":
    print("У Вас аллергия, будьте осторожны")
elif fruit == "банан":
    print("Всё в норме")
else:
    print("Неизвестный фрукт")

########################################################################################################################

########################################################################################################################
# TODO условный оператор match-case (+ python 3.10)

svetofor = "Жёлтый"
match svetofor:
    case "Красный":
        print("Стоять")
    case "Жёлтый":
        print("Готовьтесь")
    case "Зелёный":
        print("Можно идти")
    case _:
        print("Светофор сломался")

fruit = "абрикос"
match fruit:
    case "абрикос":
        print("У Вас аллергия, будьте осторожны")
    case "банан":
        print("Всё в норме")
    case _:
        print("Неизвестный фрукт")

########################################################################################################################
