########################################################################################################################
# TODO регулярные выражения

import re
import hashlib

txt = r"(?=^.{8,}$)((?=.*\d)|(?=.*\W+))(?![.\n])(?=.*[A-Z])(?=.*[a-z]).*$"
txt2 = r"^(?=.*[A-Za-z])(?=.*\d)(?=.*[@$!%*#?&])[A-Za-z\d@$!%*#?&]{8,}$"

input_from_user1 = "qwerty"
input_from_user1.isascii()  # пароль должен быть на английском
input_from_user1.isascii()  # пароль должен сод

# Минимум восемь символов, минимум одна заглавная буква, одна строчная буква и одна цифра:

# Хотя бы одна заглавная английская буква ,(?=.*?[A-Z])
# Хотя бы одна строчная английская буква,(?=.*?[a-z])
# Хотя бы одну цифру,(?=.*?[0-9])
# По крайней мере, один специальный символ,(?=.*?[#?!@$%^&*-])
# Минимум восемь в длину .{8,}(с анкерами)

password1 = "111111111"
password2 = "12345Qwerty!"
if re.match(r"^(?=.*?[a-z])(?=.*?[A-Z])(?=.*?[0-9])(?=.*?[#?!@$%^&*-]).{8,}$", string=password1):
    print("True 1")
else:
    print("False 1")

email1 = "admin.com"
email2 = "admin@gmail.com"
if re.match(r"[A-Za-z0-9._%+-]+@[A-Za-z0-9.-]+\.[A-Z|a-z]{2,}", string=email1):
    print("True 2")
else:
    print("False 2")


def check(email):
    if re.search(r'^[a-z0-9]+[._]?[a-z0-9]+@\w+[.]\w{2,3}$', email):
        print("Почта верная")
    else:
        print("Почта не верная, повторите")


check('bogdanrienko@gmail.com')

while True:
    a1 = input("Введите новый пароль:")  # python
    if not re.search(r"^.*(?=.{8,})(?=.*\d)(?=.*[a-z])(?=.*[A-Z])(?=.*[@#$%^&+=]).*$", a1):
        print("\n\nОшибка ввода, повторите ввод!\n")
        continue
    b1 = input("Введите новый пароль ещё раз:")  # python
    if a1 != b1:
        print("\n\nОшибка ввода, повторите ввод!\n")
        continue
    print(hashlib.sha512(b1.encode()))
    break

# p = re.compile('^(([^:/?#]+):)?(//([^/?#]*))?([^?#]*)(\?([^#]*))?(#(.*))?')

########################################################################################################################
